Documents/Рин1_НазначениеСотрудниковНаВРЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>Рин1_НазначениеСотрудниковНаВРЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Рин1_НазначенияСотрудниковВРЦ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьНазначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсвободитьОтНазначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Рин1_НазначенияСотрудниковВРЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>Рин1_НазначенияСотрудниковВРЦ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсвободитьОтНазначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Рин1_НазначениеСотрудниковНаВРЦ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Рин1_НазначенияСотрудниковВРЦ.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьНазначений Из ТабличнаяЧастьНазначений Цикл
		Движение = Движения.Рин1_НазначенияСотрудниковВРЦ.Добавить();
		Движение.Период = ТекСтрокаТабличнаяЧастьНазначений.ДатаНазначения;
		Движение.Сотрудник = ТекСтрокаТабличнаяЧастьНазначений.Сотрудник;
		Движение.ВРЦ = ТекСтрокаТабличнаяЧастьНазначений.ВРЦ;
		Движение.ОсвободитьОтНазначений = ТекСтрокаТабличнаяЧастьНазначений.ОсвободитьОтНазначений;
	КонецЦикла;

КонецПроцедуры
